Repository: Agents4Good/PluvIA
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Waters of Borborema
pt: PluvIA

# navMap
source: Map
pt: Mapa

# navForecast
source: Forecasts
pt: Previsões

# navSettings
source: Settings
pt: Configurações

# navContacts
source: Contacts
pt: Contatos

# notificationsScreenTitle
source: Forecasts
pt: Previsões

# severityHigh
source: High Severity
pt: Gravidade Alta

# severityMedium
source: Medium Severity
pt: Gravidade Média

# severityLow
source: Low Severity
pt: Gravidade Baixa

source: - No streets with {severity}
pt: - Nenhuma rua com {severity}

# forecastItemTitle
source: Forecast - {date}
pt: Previsão - {date}

# executionDate
source: Execution Date {date}
pt: Data de execução {date}

# notificationsError
source: Error loading notifications: {error}
pt: Erro ao carregar notificações: {error}

# error404
source: 404 - Page not found!
pt: 404 - Página não encontrada!

# error501
source: 501 - Not implemented yet!
pt: 501 - Ainda não implementado!

# buttonReturnHome
source: Return to Home
pt: Voltar a Home

# notificationChannelName
source: Important Notifications
pt: Notificações importantes

# notificationChannelDescription
source: This channel is used for important notifications.
pt: Este canal é usado para notificações importantes.

# notificationTestTitle
source: Test Notification
pt: Notificação de Teste

# notificationTestBody
source: This is a local test notification.
pt: Esta é uma notificação local de teste.

source: Image support enabled
pt: Suporte a imagem ativado

source: Loading model
pt: Carregando o modelo

# imageSupportInfoTitle
source: Model supports images
pt: O modelo suporta imagens

# imageSupportInfoBody
source: Use the üñºÔ∏è button to send images
pt: Uso o botão 🖼️ para enviar imagens

# buttonToggleView
source: Toggle view
pt: Alternar visualização

# homeWelcomeTitle
source: Welcome to Waters of Borborema
pt: Bem-vindo ao PluvIA

# homeWelcomeSubtitle
source: Explore our solution for natural disaster assistance
pt: Explore nossa solução de assistência à eventos de catástrofes naturais

# homeChatSubtitle
source: Browse a range of models running locally on your device!
pt: Navegue por uma gama de modelos que rodam localmente no seu dispositivo!

# homeMapSubtitle
source: See new forecast updates on the map!
pt: Visualize no mapa as novas atualizações de previsões!

# homeForecastSubtitle
source: Check out the latest forecasts!
pt: Cheque as últimas previsões!

# homeContactsSubtitle
source: Access your contacts list.
pt: Acesse sua lista de contatos.

# homeSettingsSubtitle
source: Go to model, home & contacts settings.
pt: Acesse as configurações de modelos, casa e contatos salvos.

# contactsTitle
source: Saved Contacts
pt: Contatos Salvos

# contactsEmptyMessage
source: Add a new contact.
pt: Adicione um novo contato.

# contactsEdit
source: Edit
pt: Editar

# contactsDelete
source: Delete
pt: Excluir

# deleteContactConfirmation
source: Are you sure you want to delete this contact?
pt: Você tem certeza de que deseja excluir este contato?

# buttonCancel
source: Cancel
pt: Cancelar

# buttonSave
source: Save
pt: Salvar

# updateContactLabelName
source: Name
pt: Nome

# updateContactLabelAddress
source: Address
pt: Endereço

# addContactLabelName
source: Name
pt: Nome

# addContactHintLocation
source: Location
pt: Localização

# highlightedFloodPoints
source: Highlighted points suffered flooding!
pt: Os pontos em destaque sofreram alagamentos!

# imageSelectionNotSupportedWeb
source: Image selection is not yet supported on the web
pt: Seleção de imagem ainda não é suportada na web

# errorSelectingImage
source: Error selecting image: {error}
pt: Erro na seleção da imagem: {error}

# addImageTooltip
source: Add image
pt: Adicionar imagem

# addDescriptionToImage
source: Add description to the image...
pt: Adicionar descrição à imagem...

source: Send message
pt: Enviar mensagem

# imageLabel
source: Image
pt: Imagem

# removeImageTooltip
source: Remove image
pt: Remover imagem
